# 0. 备份 dev 库
# 1. 创建原始数据表，导入原始数据
# 2. 补充缺失学校数据
# 3. 学科/指标数据
# 4. 转移排名数据
# 4.1. 匹配 _univ_id
# 4.2. 转移数据
# 5. 转移统计数据
# 5.1. 匹配 _univ_id
# 5.2. 转移数据
# 5.3. 指标值
# 6. 排名版本记录
# 7. 报告文件记录
# 8. 学科排名等级层次划分(dataset_subj_level)
# 9. APP 通知信息的模板，是否需要更新？
# 10. 灵魂拷问
# 10.1. 两地办学的学校，处理了吗？没有两地办学的学校
# 10.2. 是否所有院校，都有中文名称了吗？不是都有，以后再补，目前先用英文名称替代
# 10.3. 如果报告需要生成带广告的版本，在表 rk_dataset_univ_report 中构造相应的记录了吗



# 学校数据处理
# 1. 注意 code/outdated 唯一性（这一点有唯一约束保证）
# 2. 院校路径标识 up = func_calc_univ_up(name_en, pinyin)
#		注意保证有效(not outdated)记录 up 字段的唯一性
# 3. 国际院校校徽 univ.logo = substr(sha2(code,256),50,9)
